# CannotCreateSlantedWallWithSingularLayersError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CreationFailures..::..CannotCreateSlantedWallWithSingularLayersError Property
BuiltInFailures..::..CreationFailures Class See Also
---
Cannot create wall - its layers would degenerate or. Reduce the wall's height or slant.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateSlantedWallWithSingularLayersError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateSlantedWallWithSingularLayersError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateSlantedWallWithSingularLayersError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CreationFailures Class
Autodesk.Revit.DB Namespace